import { PrismaClient } from '@prisma/client'

const prisma = new PrismaClient()

async function main() {
	await prisma.bank_name.deleteMany();
	
	await prisma.bank_name.createMany({
		data: [
			{name: 'Тинькофф'},
			{name: 'Сбербанк'},
			{name: 'Альфа-Банк'},
			{name: 'ВТБ'},
			{name: 'Россельхозбанк'},
			{name: 'Почта Банк'},
			{name: 'Уралсиб'},
			{name: 'Газпромбанк'},
			{name: 'МТС Банк'},
			{name: 'ОТП Банк'},	
			{name: 'БКС Банк'},
			{name: 'Промсвязьбанк'},
			{name: 'Убрир Банк'},
			{name: 'АкБарс Банк'},
			{name: 'Райффайзенбанк'},
			{name: 'Совкомбанк'},
			{name: 'Хоум Кредит'},
			{name: 'Росбанк'},
			{name: 'Ситибанк'},
			{name: 'Траст Банк'},
			{name: 'ЮниКредит Банк'},
			{name: 'Росгосстрах Банк'},
			{name: 'Московский Кредитный Банк'},
			{name: 'Банк Открытие'},
			{name: 'Банк Санкт-Петербург'},
			{name: 'Абсолют Банк'},
			{name: 'Банк Зенит'},
			{name: 'Банк Возрождение'},
			{name: 'Банк Россия'},
			{name: 'Банк ДОМ.РФ'},
			{name: 'Банк Русский Стандарт'},
			{name: 'Банк Центр-инвест'},
			{name: 'Банк ВБРР'},
			{name: 'Банк Интеза'},
			{name: 'Банк Левобережный'},
			{name: 'Банк Приморье'},
			{name: 'Банк Синара'},
			{name: 'Банк Солидарность'},
			{name: 'Банк Точка'},
			{name: 'Банк Финансовый Стандарт'},
			{name: 'Банк Хлынов'},
			{name: 'Банк Челябинвестбанк'},
			{name: 'Банк Югра'},
			{name: 'Банк Юнистрим'},
			{name: 'Банк Энерготрансбанк'},
			{name: 'Банк Экспобанк'},
			{name: 'Банк Элита'},
			{name: 'Банк Эс-Би-Ай Банк'},
			{name: 'Амонат Банк'},
			{name: 'Душанбе Сити Банк'},
			{name: 'Азиатско-Тихоокеанский Банк'},
			{name: 'НБКО Васл'},
			{name: 'Ориён Банк'},
			{name: 'Агроинвест Банк'},
			{name: 'Банк Эсхата'},
			{name: 'Спитамен Банк'},
		]
	})
}

main()
	.then(async () => {
		await prisma.$disconnect()
	})
	.catch(async (e) => {
		console.error(e)
		await prisma.$disconnect()
		process.exit(1)
	})